src/hugs/app/views/blocklists/index.html.erb

        <tr>
          <% user_profile = Profile.where(user_id: block.blocked_id) %>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1  [["user_id", 2]]