src/hugs/app/models/conversation.rb

  def unread_message_count(current_user)
    self.messages.where("user_id != ? AND read = ?", current_user.id, false).count
---
SELECT COUNT(*) FROM "messages" WHERE "messages"."conversation_id" = $1 AND (user_id != 1 AND read = FALSE)  [["conversation_id", 1]]