src/hugs/app/views/profiles/_form.html.erb

SELECT "huglists".* FROM "huglists"
SELECT "huglists"."id" FROM "huglists" INNER JOIN "userhugs" ON "huglists"."id" = "userhugs"."huglist_id" WHERE "userhugs"."profile_id" = $1  [["profile_id", 1]]
---
    <%=hidden_field_tag 'profile[huglist_id][]', nil %>
    <% Huglist.all.each do |hug| %>
      <%= check_box_tag 'profile[huglist_id][]', hug.id, profile.huglist_ids.include?(hug.id) %>