src/hugs/app/controllers/blocklists_controller.rb

  def index
    @blocklist = Blocklist.where(user_id: current_user.id).to_a
---
SELECT "blocklists".* FROM "blocklists" WHERE "blocklists"."user_id" = $1  [["user_id", 1]]

  def create
    @blocklist = current_user.blocklists.create(blocked_id: blocklist_params)
---
INSERT INTO "blocklists" ("user_id", "blocked_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["blocked_id", 2], ["created_at", "2020-05-20 17:49:19.881138"], ["updated_at", "2020-05-20 17:49:19.881138"]]

  def set_block
    @block = Blocklist.find(params[:id])
---
SELECT  "blocklists".* FROM "blocklists" WHERE "blocklists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]