src/hugs/app/controllers/conversations_controller.rb

SELECT "conversations".* FROM "conversations" WHERE (sender_id = 2 OR receiver_id = 2)
---
  def index
    @conversations = Conversation.where("sender_id = ? OR receiver_id = ?", current_user.id, current_user.id)

SELECT  1 AS one FROM "conversations" WHERE "conversations"."sender_id" = $1 AND "conversations"."receiver_id" = $2 LIMIT $3  [["sender_id", 2], ["receiver_id", 1], ["LIMIT", 1]]
SELECT "conversations".* FROM "conversations" WHERE ((conversations.sender_id = '2' AND conversations.receiver_id = '1') OR (conversations.receiver_id = '2' AND conversations.sender_id = '1'))
SELECT  "conversations".* FROM "conversations" WHERE ((conversations.sender_id = '2' AND conversations.receiver_id = '1') OR (conversations.receiver_id = '2' AND conversations.sender_id = '1')) ORDER BY "conversations"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "conversations" ("sender_id", "receiver_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sender_id", 2], ["receiver_id", 1], ["created_at", "2020-05-20 07:53:37.303843"], ["updated_at", "2020-05-20 07:53:37.303843"]]
---
  def create
    if Conversation.between(params[:sender_id], params[:receiver_id]).present?
      @conversation = Conversation.between(params[:sender_id], params[:receiver_id]).first
    else
      @conversation = Conversation.create!(conversation_params)