src/hugs/app/controllers/messages_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  before_action :authenticate_user!

  before_action do
    @conversation = Conversation.find(params[:conversation_id])
    partner_id = (@conversation.sender_id == current_user.id) ? @conversation.receiver_id : @conversation.sender_id
    @conversation_partner = User.find(partner_id).profile

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1  [["conversation_id", 1]]
UPDATE "messages" SET "read" = TRUE WHERE "messages"."conversation_id" = $1 AND (user_id != 1 AND read = FALSE)  [["conversation_id", 1]]
---
  def index
    @messages = @conversation.messages

    @messages.where("user_id != ? AND read = ?", current_user.id, false).update_all(read: true)

INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Wanna hug?"], ["conversation_id", 1], ["user_id", 1], ["created_at", "2020-05-20 18:24:48.432669"], ["updated_at", "2020-05-20 18:24:48.432669"]]
---
  def create
    @message = @conversation.messages.new(message_params)
    @message.user = current_user

    if @message.save

SELECT "blocklists".* FROM "blocklists" WHERE "blocklists"."blocked_id" = $1 AND "blocklists"."user_id" = $2  [["blocked_id", 2], ["user_id", 1]]
---
  def set_blocked
    @blocked = Blocklist.where(blocked_id: current_user.id, user_id: @conversation_partner[:user_id]).present?