src/hugs/app/controllers/profiles_controller.rb

SELECT "huglists"."id" FROM "huglists" INNER JOIN "userhugs" ON "huglists"."id" = "userhugs"."huglist_id" WHERE "userhugs"."profile_id" = $1  [["profile_id", 1]]
---
  def find_hug_matches(profile_id)
    # Find hugs of a nominated profile
    profile_hugs = Profile.find(profile_id).huglists.pluck(:huglist_id)

UPDATE "profiles" SET "updated_at" = $1 WHERE "profiles"."id" = $2  [["updated_at", "2020-05-23 06:41:21.929160"], ["id", 1]]
---
  def find_near_profile(profile, range)
    # Use Profile.near method provided by Geocoder gem to search for nearest profiles within rang
    results = profile.nearbys(range, units: :km).where.not(user_id: current_user.profile.id).where.not(user_id: @blocked_list)

    # Determine profiles and order
    list = []
    results.each do |result|
      result[:id]
      list.push(result[:id])
    end
    p "'list' : #{list}"

    # Retrieve profiles
    profile_data = Profile.all.where(id: list)
    profiles_sorted = []
    puts "profile_data.each loop..."
    list.each do |order_id|
      profile_data.each do |entry|
        if order_id == entry["id"]
          p entry
          profiles_sorted.push(entry)