src/hugs/app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" NOT IN ($1, $2)  [["user_id", 1], ["user_id", 3]]
---
  def index
    @excluded = (@blocked_by_list << @blocked_list).flatten!
    @excluded.push(current_user["id"])
    @profiles = Profile.where.not(user_id: @excluded)

SELECT "huglists"."hugtype" FROM "huglists" INNER JOIN "userhugs" ON "huglists"."id" = "userhugs"."huglist_id" WHERE "userhugs"."profile_id" = $1  [["profile_id", 1]]
---
  def show
    @profile_hugs = @profile.huglists.pluck(:hugtype).join(", ").capitalize

INSERT INTO "profiles" ("user_id", "name_first", "name_second", "name_display", "description", "street_number", "road", "suburb", "city", "state", "postcode", "country", "created_at", "updated_at", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save

UPDATE "profiles" SET "updated_at" = $1 WHERE "profiles"."id" = $2  [["updated_at", "2020-05-23 05:31:11.553595"], ["id", 1]]
---
  def update
    profile = profile_params[:profile]
    puts params[:huglist_id]
    respond_to do |format|
      if @profile.update(profile_params)

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_user_profile
    if User.find(current_user["id"]).profile == nil
      redirect_to new_profile_path
    else
      @profile = Profile.find(current_user["id"])