src/hugs/app/controllers/profiles_controller.rb

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "updated_at" = $1 WHERE "profiles"."id" = $2  [["updated_at", "2020-05-23 06:41:21.929160"], ["id", 1]]